In [173]:
import pandas as pd
import numpy as np

In [174]:
credits_df = pd.read_csv("credits_df.csv")
titles_df = pd.read_csv("titles_df.csv")

In [102]:
credits_df.head()

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [103]:
credits_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77801 entries, 0 to 77800
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   person_id  77801 non-null  int64
 1   id         77801 non-null  object
 2   name       77801 non-null  object
 3   character  68029 non-null  object
 4   role       77801 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.0+ MB

In [175]:
#Eliminamos los espacios en blanco al inicio y al final y lo dejamos todo en minuscula
credits_df["name"] = credits_df["name"].str.lower().str.strip()
credits_df["role"] = credits_df["role"].str.lower().str.strip()

In [176]:
#Nos quedamos con todos los id que empiezan por 'tm' ya que son los id de peliculas
credits_df = credits_df[credits_df["id"].str.startswith("tm") == True]
credits_df = credits_df.reset_index(drop= True)

In [177]:
#eliminamos la columna character

columns_to_drop_credits = ["character"]
credits_df = credits_df.drop(columns = columns_to_drop_credits, axis = 1)

In [107]:
credits_df

       person_id         id                name      role
0           3748    tm84618      robert de niro     actor
1          14658    tm84618        jodie foster     actor
2           7064    tm84618       albert brooks     actor
3           3739    tm84618       harvey keitel     actor
4          48933    tm84618     cybill shepherd     actor
...          ...        ...                 ...       ...
63086     736339  tm1059008    adelaida buscato     actor
63087     399499  tm1059008  luz stella luengas     actor
63088     373198  tm1059008         inés prieto     actor
63089     378132  tm1059008        isabel gaona     actor
63090    1950416  tm1059008      julian gaviria  director

[63091 rows x 4 columns]

In [108]:
titles_df.head(2)

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179

In [109]:
titles_df.shape

(5850, 15)

In [110]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5850 entries, 0 to 5849
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    5850 non-null   object
 1   title                 5849 non-null   object
 2   type                  5850 non-null   object
 3   description           5832 non-null   object
 4   release_year          5850 non-null   int64
 5   age_certification     3231 non-null   object
 6   runtime               5850 non-null   int64
 7   genres                5850 non-null   object
 8   production_countries  5850 non-null   object
 9   seasons               2106 non-null   float64
 10  imdb_id               5447 non-null   object
 11  imdb_score            5368 non-null   float64
 12  imdb_votes            5352 non-null   float64
 13  tmdb_popularity       5759 non-null   float64
 14  tmdb_score            5539 non-null   float64
dtypes: float64(5), int64(2), object(8)
memory usage: 685.7+ KB

In [111]:
titles_df.nunique()

id                      5850
title                   5798
type                       2
description             5829
release_year              63
age_certification         11
runtime                  202
genres                  1726
production_countries     452
seasons                   26
imdb_id                 5447
imdb_score                80
imdb_votes              3880
tmdb_popularity         4889
tmdb_score               394
dtype: int64

In [112]:
titles_df["age_certification"].unique()

array(['TV-MA', 'R', 'PG', nan, 'TV-14', 'PG-13', 'TV-PG', 'TV-Y', 'TV-G',
       'TV-Y7', 'G', 'NC-17'], dtype=object)

In [113]:
titles_df["title"].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
5845    False
5846    False
5847    False
5848    False
5849    False
Name: title, Length: 5850, dtype: bool

In [114]:
titles_df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
5845    False
5846    False
5847    False
5848    False
5849    False
Length: 5850, dtype: bool

In [178]:
#eliminamos SHOW de columna type

new_type = ["MOVIE"]
titles_df = titles_df[titles_df["type"].isin(new_type) == True]

In [179]:
#eliminamos la columna type, seasons, age_certification y imdb_id

columns_to_drop = ["type", "age_certification", "seasons", "imdb_id"]
titles_df = titles_df.drop(columns = columns_to_drop, axis = 1)

In [117]:
titles_df.nunique()

id                      3744
title                   3724
description             3734
release_year              62
runtime                  197
genres                  1105
production_countries     418
imdb_id                 3482
imdb_score                74
imdb_votes              2747
tmdb_popularity         3248
tmdb_score               266
dtype: int64

In [180]:
#eliminamos el único título nulo

titles_df = titles_df.dropna(subset=["title"])

titles_df["title"].isnull().sum()

0

In [181]:
#descartamos que haya títulos duplicados que tengan el mismo año de lanzamiento

grouped = titles_df[["title", "release_year"]]
grouped.duplicated().sum()

0

In [182]:
""" Eliminamos las filas que no tienen género:
- Creamos un nuevo dataframe solo con las columnas 'title' y 'genres'.
- Creamos una lista vacía para añadir el id de los registros sin género.
- Quitamos corchetes y comillas de los géneros y creamos una lista nueva que tome cada palabra por separado.
- Si la lista está vacía, la añadimos a la nueva lista.
- Reseteamos el índice.
- Eliminamos las filas sin género del dataframe principal.

"""
grouped_2 = titles_df[["title", "genres"]].reset_index(drop=True)
grouped_2

id_to_erase = []

for name in range(0, len(grouped_2)):
    l = grouped_2.iloc[name]["genres"].replace('[', "").replace("]", "").replace("'", "").split(", ")
    if l[0] == "":
        id_to_erase.append(name)

titles_df.reset_index(drop=True, inplace=True)

titles_df = titles_df.drop(id_to_erase, axis=0).dropna(subset="genres")

titles_df = titles_df.reset_index(drop=True)

In [183]:
#Aqui transformamos los datos de genres a una lista

list_genre = []

for name in range(0, len(titles_df)):
    list_genre.append(titles_df.iloc[name]["genres"].replace('[', "").replace("]", "").replace("'", "").split(", "))

titles_df["genres"] = list_genre

In [184]:
#Aqui transformamos los datos de production_countries a una lista

list_country = []
for name in range(0, len(titles_df)):
    list_country.append(titles_df.iloc[name]["production_countries"].replace('[', "").replace("]", "").replace("'", "").split(", "))

titles_df["production_countries"] = list_country

In [185]:
#Eliminamos los espacios en blanco al inicio y al final y lo dejamos todo en minuscula
titles_df["title"] = titles_df["title"].str.lower().str.strip()
titles_df["description"] = titles_df["description"].str.lower().str.strip()

In [137]:
#Aqui comprobamos que los anyos tienen 4 digitos

id_to_erase = []

for name in range(0, len(titles_df)):
    year = str(titles_df.iloc[name]["release_year"])
    
    if len(year) != 4:
        id_to_erase.append(name)


id_to_erase

[]

In [186]:
titles_df

,id,title,description,release_year,runtime,genres,production_countries,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,tm84618,taxi driver,a mentally unstable vietnam war veteran works ...,1976,114,"[drama, crime]",[US],8.2,808582.0,40.965,8.179
1,tm154986,deliverance,intent on seeing the cahulawassee river before...,1972,109,"[drama, action, thriller, european]",[US],7.7,107673.0,10.010,7.300
2,tm127384,monty python and the holy grail,"king arthur, accompanied by his squire, recrui...",1975,91,"[fantasy, action, comedy]",[GB],8.2,534486.0,15.461,7.811
3,tm120801,the dirty dozen,12 american military prisoners in world war ii...,1967,150,"[war, action]","[GB, US]",7.7,72662.0,20.398,7.600
4,tm70993,life of brian,"brian cohen is an average young jewish man, bu...",1979,94,[comedy],[GB],8.0,395024.0,17.770,7.800
...,...,...,...,...,...,...,...,...,...,...,...
3705,tm1066324,super monsters: once upon a rhyme,the super monsters rethink exemplary fantasies...,2021,25,"[animation, family]",[],5.6,38.0,53.762,6.300
3706,tm1097142,my bride,the story follows a young man and woman who go...,2021,93,"[romance, comedy, drama]",[EG],5.0,327.0,2.545,5.300
3707,tm1014599,fine wine,a beautiful love story that can happen between...,2021,100,"[romance, drama]",[NG],6.8,45.0,1.466,NaN
3708,tm898842,c/o kaadhal,a heart warming film that explores the concept...,2021,134,[drama],[],7.7,348.0,NaN,NaN
3709,tm1059008,lokillo,a controversial tv host and comedian who has b...,2021,90,[comedy],[CO],3.8,68.0,26.005,6.300